#pragma once

#include "Foo.h"


class Bar
{
    int m_data;

public:
	Bar() = default;//////////якщо у класі є конструктор з параметрами, конструктор без параметрів за замовчуванням не створюється. А ми хочемо забезпечити створення пустого обьекту з використанням конструктора без параметрів за замовчуванням, тоді позначаємо = default
	/*Bar(int a) :m_data(a)
	{}*/
   explicit Bar( int data);/////  можна тільки явні перетворення




   void Show() ;

};
/*

explicit пишеться тільки в прототипі методу, у коді
реалізації конструктора його повторювати не треба

explicit це ключеве слово ставиться перед оголошенням конструктора с одним параметром (чи с більшим числом параметрів, але когда всі параметры, починаючи з другого, мають значення за замовчуванням) і запобігає неявному перетворенню типів при ініціалізації.*/